In [16]:
import pandas as pd
import numpy as np
df1 = pd.DataFrame({'A':[1,2,np.nan],
                   'B':['a',np.nan,'c'],
                   'c':[10,np.nan,np.nan]})
print(df1)

     A    B     c
0  1.0    a  10.0
1  2.0  NaN   NaN
2  NaN    c   NaN

In [6]:
print(df1.fillna(9))

     A  B     c
0  1.0  a  10.0
1  2.0  9   9.0
2  9.0  c   9.0

In [8]:
df1['A'].fillna(df1['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [9]:

df1['A'].fillna(df1['A'].sum())

0    1.0
1    2.0
2    3.0
Name: A, dtype: float64

In [17]:
df1.dropna()
# this dropna operation removes all rows with null values in any column. If you want to remove rows with null values only in 
# specific columns, you can use the subset parameter.

     A  B     c
0  1.0  a  10.0

In [ ]:
print(df1.dropna(inplace=True))
# when we use inplace=True, it changes the original dataframe. If you want to keep the original dataframe, you can use df1.copy()

None

In [23]:
df1

     A    B     c     D
0  1.0    a  10.0  11.0
1  2.0  NaN   NaN   NaN
2  NaN    c   NaN   NaN

In [ ]:
df1['D']=df1['A']+df1['c']
# it will give NaN values in the D column where A or c is NaN.
# in the d column the values will be NaN if either A or c is NaN.

In [ ]:
import pandas as pd
import numpy as np
df = pd.DataFrame(np.random.randn(5, 3), index=['A', 'B', 'C', 'D', 'E'],columns=['one', 'two', 'three'])
df = df.reindex(['A', 'B', 'C', 'D', 'E', 'F','G'])
print(df.dropna(axis=1))